Revit 2027 API
LayerModifier.ModifierType Property
 The modifier type of LayerModifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ModifierType ModifierType { get; set; }
Public Property ModifierType As ModifierType
	Get
	Set
public:
property ModifierType ModifierType {
	ModifierType get ();
	void set (ModifierType value);
}
member ModifierType : ModifierType with get, set
Property Value
ModifierType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
LayerModifier Class
Autodesk.Revit.DB Namespace